// 9. Задача
// Од стандарден влез се читаат непознат број на хексадецимални цифри се додека не се внесе точка (.).
// Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри.
// Доколку добиениот декаден збир е делив со 16 се печати Pogodok.
// Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 (последните цифри му се 1 и 6),
// се печати Poln pogodok инаку се печати самиот збир.

#include <stdio.h>
#include <ctype.h>

int main() {
  int s = 0;
  char vrednosti[16] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F'};

  while(1) {
    char c;
    scanf(" %c", &c);

    if(c == '.') {
      break;
    }

    for(int i = 0; i < 16; i++) {
      if(toupper(c) == vrednosti[i]) {
        s += i;
      }
    }
  }

  if(s % 16 == 0) {
    if(s % 100 == 16) {
      printf("Poln pogodok");
    } else {
      printf("Pogodok");
    }
  } else {
    printf("%d", s);
  }

  return 0;
}
