// 18. Задача
// За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2)
// и елементите на матрицата (реални броеви).
// Нека X e збирот од елементите под главната дијагонала во матрицата А.
// Нека Y е збирот од елементите под споредната дијагонала во матрицата А.
//
// Да се креира нова матрица B на следниот начин:
// сите елементи од главната дијагонала во матрицата B треба да имаат вредност X
// сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y
// ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y
// сите останати елементи во матрицата B имаат вредност 0

#include <stdio.h>

int main() {
  int n;
  scanf("%d", &n);

  float A[n][n], B[n][n];

  float s1 = 0, s2 = 0;
  for(int i = 0; i < n; i++) {
    for(int j = 0; j < n; j++) {
      scanf("%f", &A[i][j]);
      B[i][j] = 0;

      if(i > j) { s1 += A[i][j]; }
      if((n - 1 - i) < j) { s2 += A[i][j]; }
    }
  }

  for(int i = 0; i < n; i++) { B[i][i] = s1; }
  for(int i = 0; i < n; i++) { B[i][n - 1 - i] = s2; }

  if(n % 2 != 0) { B[n / 2][n / 2] = s1 + s2; }

  for(int i = 0; i < n; i++) {
    for(int j = 0; j < n; j++) {
      printf("%.1f ", B[i][j]);
    }
    printf("\n");
  }

  return 0;
}
