// 13. Задача
// Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви),
// како и елементите на матрицата со димензии M x N (цели броеви).
//
// Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
// Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
// Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
// Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

#include <stdio.h>

int main() {
  int x, n, m;
  scanf("%d", &x);
  scanf("%d %d", &n, &m);

  int matrica[n][m], solved[n][m];

  for(int i = 0; i < n; i++) {
    for(int j = 0; j < m; j++) {
      scanf("%d", &matrica[i][j]);
    }
  }

  for(int i = 0; i < n; i++) {
    int s = 0;
    for(int j = 0; j < m; j++) { s += matrica[i][j]; }
    for(int k = 0; k < m; k++) { solved[i][k] = s > x ? 1 : s < x ? -1 : 0; }
  }

  for(int i = 0; i < n; i++) {
    for(int j = 0; j < m; j++) {
      printf("%d ", solved[i][j]);
    }
    printf("\n");
  }

  return 0;
}