// 15. Задача
// За еден природен број а велиме дека е порамнување на друг природен број b ако и
// само ако цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.
// Пример. Бројот 734775 е порамнување на бројот 934795.
// Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100),
// се додека не се внесе нешто што не може да се интерпретира како цел број.
// Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви,
// по редослед од најмалиот кон најголемиот.
// Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
// Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).
// ЗАБРАНЕТО е користење на глобални променливи

#include <stdio.h>

int poramnet(int a) {
  if(a < 10) {
    if(a % 10 != 9) { return a; }
    else { return 7; }
  }

  int s = poramnet(a / 10);

  if(a % 10 != 9) { return (s * 10) + (a % 10); }
  else { return (s * 10) + 7; }
}

int main() {
  int n, niza[100], ct = 0;

  while(scanf("%d", &n)) {
    niza[ct] = poramnet(n);
    ct++;
  }

  for(int i = 1; i < ct; i++) {
    if(niza[i] < niza[i - 1]) {
      int pom = niza[i];
      niza[i] = niza[i - 1];
      niza[i - 1] = pom;
      i = 0;
    }
  }

  int elementi = ct <= 5 ? ct : 5;

  for(int i = 0; i < elementi; i++) {
    printf("%d ", niza[i]);
  }

  return 0;
}