// 16. Задача
// Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
// Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број.
// За секој од нив да се испечати максималната цифра во посебен ред.
// Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.
// Забелешка: ЗАБРАНЕТО е користење на глобални променливи.

#include <stdio.h>

int najgolemaCifra(int n, int najgolema) {
    if(n != 0) {
        if(n % 10 > najgolema) { return najgolemaCifra(n / 10, n % 10); }
        else { return najgolemaCifra(n / 10, najgolema); }
    } else {
        return najgolema;
    }
}

int main() {
    int n;

    while(scanf("%d", &n)) {
        printf("%d\n", najgolemaCifra(n / 10, n % 10));
    }

    return 0;
}