// 3. Задача
// Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100),
// а потоа се внесува и цел број ind (ind >= 0).
// Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата)
// и бројот на валидни елементи во низата.
// Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата.
// Ако индексот ind е поголем од N функцијата треба да врати 0.
//
// НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

#include <stdio.h>

int sum_pos(int *niza, int indeks, int n) {
  int s = 0;
  for(int i = indeks; i < n; i++) { s += *(niza + i); }

  return s;
}

int main() {
  int n, index, niza[n];
  
  scanf("%d", &n);
  for(int i = 0; i < n; i++) { scanf("%d", &niza[i]); }
  scanf("%d", &index);

  if(index > n) { printf("0"); return 0; }

  printf("%d", sum_pos(niza, index, n));

  return 0;
}