// 7. Задача
// Од тастатура се внесуваат димензиите на една матрица (m, n <= 100), а потоа и елементите од матрицата.
// Да се генерира низа (со најмногу m) така што секој елемент од низата се добива со наоѓање на елементот во
// секоја редица од матрицата што е најоддалечен од аритметичката средина во рамки на таа редица.
// Ако постојат повеќе елементи што се најоддалечени од аритметичката средина, тогаш се зема предвид првиот.
// едоследот на запишување на елементите во низата одговара на редоследот на редиците.
//
// Пример:
// Влез:
// 3 6
// 1 2 2 3 4 5
// 1 1 2 2 3 3
// 1 2 3 4 5 6
//
// Излез:
//5 1 1

#include <stdio.h>

double apsolutna(double n) {
    return n >= 0 ? n : -n;
}

int main() {
    int n, m, naj;
    double s, prosek;
    scanf("%d %d", &n, &m);

    int matrica[n][m];

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < m; j++) {
            scanf("%d", &matrica[i][j]);
        }
    }

    for(int i = 0; i < n; i++) {
        s = 0;
        for(int j = 0; j < m; j++) {
            s += matrica[i][j];
        }

        prosek = s / m;
        naj = matrica[i][0];

        for(int j = 0; j < m; j++) {
            if(apsolutna(prosek - matrica[i][j]) > apsolutna(prosek - naj)) {
                naj = matrica[i][j];
            }
        }

        printf("%d ", naj);
    }

    return 0;
}
