// 6. Задача
// Да се напише програма која вчитува матрица со димензии MxN (макс. 100x100).
// На почетокот се внесуваат димензиите на матрицата, а потоа и елементите на матрицата кои се само вредностите 1 и 0.
// Програмата треба да изброи и отпечати на СИ во колку од редиците и колоните има барем 3 последователни елементи со вредност 1.

#include <stdio.h>

int main() {
    int n, m, ct = 0, mat[100][100];
    scanf("%d %d", &n, &m);

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < m; j++) {
            scanf("%d", &mat[i][j]);
        }
    }

    for(int i = 0; i < n; i++) {
        for(int j = 0; j < m; j++) {
            if(mat[i][j] == 1 && mat[i][j + 1] == 1 && mat[i][j + 2] == 1) {
                ct++;
                break;
            }
        }
    }
    
    for(int i = 0; i < m; i++) {
        for(int j = 0; j < n; j++) {
            if(mat[j][i] == 1 && mat[j + 1][i] == 1 && mat[j + 2][i] == 1) {
                ct++;
                break;
            }
        }
    }

    printf("%d", ct);

    return 0;
}
