// 2.1 - 7
// Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви. 
// Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
// По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
// Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

#include <stdio.h>

void premesti(int a[100], int n) {
    int b[100], indeks = 0;

    for(int i = 0; i < n; i++) {
        if(a[i] >= 0) b[indeks++] = a[i];
    }

    for(int i = 0; i < n; i++) {
        if(a[i] < 0) b[indeks++] = a[i];
    }

    for(int i = 0; i < n; i++) {
        a[i] = b[i];
    }
}

int main() {
    int n;
    scanf("%d", &n);

    int a[100];

    for(int i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }

    premesti(a, n);

    for(int i = 0; i < n; i++) {
        printf("%d ", a[i]);
    }

    return 0;
}
